# Cumulative P2-First Exp7: Lite Version (RepVGG + PConv 轻量化)
# 在 06_dyhead 基础上:
#   - 所有 C2f → C2f_Lite (内部Bottleneck: Conv→RepConv + PConv)
#   - C2f_EMA 保持不变 (EMA注意力不可替代)
#   - 其余模块 (SPDConv, CDGM, DyHeadDetect) 不变
nc: 1
scales:
  n: [0.33, 0.25, 1024]
scale: n

backbone:
  - [-1, 1, SPDConv, [64]]           # 0
  - [-1, 1, SPDConv, [128]]          # 1
  - [-1, 3, C2f_Lite, [128, True]]   # 2  ★轻量
  - [-1, 1, SPDConv, [256]]          # 3
  - [-1, 6, C2f_EMA, [256, True]]    # 4  (EMA保持)
  - [-1, 1, SPDConv, [512]]          # 5
  - [-1, 6, C2f_Lite, [512, True]]   # 6  ★轻量
  - [-1, 1, SPDConv, [1024]]         # 7
  - [-1, 3, C2f_Lite, [1024, True]]  # 8  ★轻量
  - [-1, 1, SPPF, [1024, 5]]         # 9

head:
  # FPN P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10
  - [[-1, 6], 1, CDGM, []]                        # 11
  - [-1, 3, C2f_Lite, [512]]                      # 12 ★轻量
  # FPN P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [[-1, 4], 1, CDGM, []]                        # 14
  - [-1, 3, C2f_Lite, [256]]                      # 15 ★轻量
  # FPN P2
  - [15, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  - [[-1, 2], 1, CDGM, []]                        # 17
  - [-1, 3, C2f_Lite, [128]]                      # 18 ★轻量
  # PAN P3
  - [18, 1, Conv, [128, 3, 2]]                    # 19
  - [[-1, 15], 1, Concat, [1]]                    # 20
  - [-1, 3, C2f_Lite, [256]]                      # 21 ★轻量
  # PAN P4
  - [21, 1, Conv, [256, 3, 2]]                    # 22
  - [[-1, 12], 1, Concat, [1]]                    # 23
  - [-1, 3, C2f_Lite, [512]]                      # 24 ★轻量
  # PAN P5
  - [24, 1, Conv, [512, 3, 2]]                    # 25
  - [[-1, 9], 1, Concat, [1]]                     # 26
  - [-1, 3, C2f_Lite, [1024]]                     # 27 ★轻量
  # Detect 4-scale with DyHeadDetect
  - [[18, 21, 24, 27], 1, DyHeadDetect, [nc]]     # 28
