# Cumulative P2-First Exp5: complete_v2 (+ASGv2├Ś4)
nc: 1
scales:
  n: [0.33, 0.25, 1024]
scale: n

backbone:
  - [-1, 1, SPDConv, [64]]           # 0
  - [-1, 1, SPDConv, [128]]          # 1
  - [-1, 3, C2f, [128, True]]        # 2
  - [-1, 1, SPDConv, [256]]          # 3
  - [-1, 6, C2f_EMA, [256, True]]    # 4
  - [-1, 1, SPDConv, [512]]          # 5
  - [-1, 6, C2f, [512, True]]        # 6
  - [-1, 1, SPDConv, [1024]]         # 7
  - [-1, 3, C2f, [1024, True]]       # 8
  - [-1, 1, SPPF, [1024, 5]]         # 9

head:
  # FPN P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10
  - [[-1, 6], 1, CDGM, []]                        # 11
  - [-1, 3, C2f, [512]]                           # 12
  # FPN P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [[-1, 4], 1, CDGM, []]                        # 14
  - [-1, 3, C2f, [256]]                           # 15
  # FPN P2
  - [15, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  - [[-1, 2], 1, CDGM, []]                        # 17
  - [-1, 3, C2f, [128]]                           # 18
  - [-1, 1, ASG, []]                              # 19 Ōśģ ASGŌåÆP2µŻĆµĄŗ
  # PAN P3 (v2: Conv from C2f)
  - [18, 1, Conv, [128, 3, 2]]                    # 20
  - [[-1, 15], 1, Concat, [1]]                    # 21
  - [-1, 3, C2f, [256]]                           # 22
  - [-1, 1, ASG, []]                              # 23 Ōśģ ASGŌåÆP3µŻĆµĄŗ
  # PAN P4
  - [22, 1, Conv, [256, 3, 2]]                    # 24
  - [[-1, 12], 1, Concat, [1]]                    # 25
  - [-1, 3, C2f, [512]]                           # 26
  - [-1, 1, ASG, []]                              # 27 Ōśģ ASGŌåÆP4µŻĆµĄŗ
  # PAN P5
  - [26, 1, Conv, [512, 3, 2]]                    # 28
  - [[-1, 9], 1, Concat, [1]]                     # 29
  - [-1, 3, C2f, [1024]]                          # 30
  - [-1, 1, ASG, []]                              # 31 Ōśģ ASGŌåÆP5µŻĆµĄŗ
  # Detect 4-scale
  - [[19, 23, 27, 31], 1, Detect, [nc]]           # 32
