# Exp8: Lite version вҖ” Backbone ConvвҶ’GSConv + Bottleneck C2fвҶ’PConv
# еңЁ 06_dyhead еҹәзЎҖдёҠ:
#   - Backbone SPDConv вҶ’ GSConv (ж·ұеәҰеҸҜеҲҶзҰ»+shuffle, еҸӮж•°йҮҸ-40%)
#   - C2f вҶ’ C2f_PConv (BottleneckеҶ…з¬¬дәҢдёӘ3Г—3жҚўPConv, -20%)
#   - C2f_EMA дҝқжҢҒ (EMAжіЁж„ҸеҠӣдёҚеҸҜжӣҝд»Ј)
#   - CDGM, DyHeadDetect дёҚеҸҳ
nc: 1
scales:
  n: [0.33, 0.25, 1024]
scale: n

backbone:
  - [-1, 1, GSConv, [64, 3, 2]]      # 0  вҳ…GSConvжӣҝд»ЈSPDConv
  - [-1, 1, GSConv, [128, 3, 2]]     # 1  вҳ…GSConvжӣҝд»ЈSPDConv
  - [-1, 3, C2f_PConv, [128, True]]  # 2  вҳ…иҪ»йҮҸC2f
  - [-1, 1, GSConv, [256, 3, 2]]     # 3  вҳ…GSConvжӣҝд»ЈSPDConv
  - [-1, 6, C2f_EMA, [256, True]]    # 4  (EMAдҝқжҢҒ)
  - [-1, 1, GSConv, [512, 3, 2]]     # 5  вҳ…GSConvжӣҝд»ЈSPDConv
  - [-1, 6, C2f_PConv, [512, True]]  # 6  вҳ…иҪ»йҮҸC2f
  - [-1, 1, GSConv, [1024, 3, 2]]    # 7  вҳ…GSConvжӣҝд»ЈSPDConv
  - [-1, 3, C2f_PConv, [1024, True]] # 8  вҳ…иҪ»йҮҸC2f
  - [-1, 1, SPPF, [1024, 5]]         # 9

head:
  # FPN P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10
  - [[-1, 6], 1, CDGM, []]                        # 11
  - [-1, 3, C2f_PConv, [512]]                     # 12 вҳ…иҪ»йҮҸ
  # FPN P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [[-1, 4], 1, CDGM, []]                        # 14
  - [-1, 3, C2f_PConv, [256]]                     # 15 вҳ…иҪ»йҮҸ
  # FPN P2
  - [15, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  - [[-1, 2], 1, CDGM, []]                        # 17
  - [-1, 3, C2f_PConv, [128]]                     # 18 вҳ…иҪ»йҮҸ
  # PAN P3
  - [18, 1, GSConv, [128, 3, 2]]                  # 19 вҳ…GSConvдёӢйҮҮж ·
  - [[-1, 15], 1, Concat, [1]]                    # 20
  - [-1, 3, C2f_PConv, [256]]                     # 21 вҳ…иҪ»йҮҸ
  # PAN P4
  - [21, 1, GSConv, [256, 3, 2]]                  # 22 вҳ…GSConvдёӢйҮҮж ·
  - [[-1, 12], 1, Concat, [1]]                    # 23
  - [-1, 3, C2f_PConv, [512]]                     # 24 вҳ…иҪ»йҮҸ
  # PAN P5
  - [24, 1, GSConv, [512, 3, 2]]                  # 25 вҳ…GSConvдёӢйҮҮж ·
  - [[-1, 9], 1, Concat, [1]]                     # 26
  - [-1, 3, C2f_PConv, [1024]]                    # 27 вҳ…иҪ»йҮҸ
  # Detect 4-scale with DyHeadDetect
  - [[18, 21, 24, 27], 1, DyHeadDetect, [nc]]     # 28
