# Cumulative P2-First Exp6: P2+SPDConv+EMA+CDGM+DyHeadDetect (取代ASG)
nc: 1
scales:
  n: [0.33, 0.25, 1024]
scale: n

backbone:
  - [-1, 1, SPDConv, [64]]           # 0
  - [-1, 1, SPDConv, [128]]          # 1
  - [-1, 3, C2f, [128, True]]        # 2
  - [-1, 1, SPDConv, [256]]          # 3
  - [-1, 6, C2f_EMA, [256, True]]    # 4
  - [-1, 1, SPDConv, [512]]          # 5
  - [-1, 6, C2f, [512, True]]        # 6
  - [-1, 1, SPDConv, [1024]]         # 7
  - [-1, 3, C2f, [1024, True]]       # 8
  - [-1, 1, SPPF, [1024, 5]]         # 9

head:
  # FPN P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10
  - [[-1, 6], 1, CDGM, []]                        # 11
  - [-1, 3, C2f, [512]]                           # 12
  # FPN P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [[-1, 4], 1, CDGM, []]                        # 14
  - [-1, 3, C2f, [256]]                           # 15
  # FPN P2
  - [15, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  - [[-1, 2], 1, CDGM, []]                        # 17
  - [-1, 3, C2f, [128]]                           # 18
  # PAN P3
  - [18, 1, Conv, [128, 3, 2]]                    # 19
  - [[-1, 15], 1, Concat, [1]]                    # 20
  - [-1, 3, C2f, [256]]                           # 21
  # PAN P4
  - [21, 1, Conv, [256, 3, 2]]                    # 22
  - [[-1, 12], 1, Concat, [1]]                    # 23
  - [-1, 3, C2f, [512]]                           # 24
  # PAN P5
  - [24, 1, Conv, [512, 3, 2]]                    # 25
  - [[-1, 9], 1, Concat, [1]]                     # 26
  - [-1, 3, C2f, [1024]]                          # 27
  # Detect 4-scale with DyHeadDetect (取代 ASG×4 + Detect)
  - [[18, 21, 24, 27], 1, DyHeadDetect, [nc]]     # 28
