# YOLOv8 ShipRS-v4 消融实验配置

# 仅 Box Scale Loss 消融实验
nc: 1
scales:
  [[10, 1.0, 1.0, 256],
   [20, 1.0, 1.0, 512],
   [40, 1.0, 1.0, 768],
   [80, 1.0, 1.0, 1024]]

backbone:
  [[-1, 1, Conv, [64, 6, 2, 2]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, C2f, [128, True]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 6, C2f, [256, True]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 9, C2f, [512, True]],
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 3, C2f, [1024, True]],
   [-1, 1, SPPF, [1024, 5]],
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C2f, [512]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, C2f, [256]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 13], 1, Concat, [1]],
   [-1, 3, C2f, [512]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 8], 1, Concat, [1]],
   [-1, 3, C2f, [1024]],
   [[17, 20, 23], 1, Detect, [nc]]]

# 仅启用 Box Scale Loss，禁用其他改进模块
box_scale_loss: true
scale_factor: 0.5
sadl: false
nwd: false
shape_iou: false

# 模型说明：
# 此配置仅测试 Box Scale Loss 的效果
# 基础网络使用标准 C2f 模块
# 不包含 DASC、BSA、SOAU 改进
# 用于验证 Box Scale Loss 对小目标的单独贡献