# Ultralytics AGPL-3.0 License
# 消融实验: YOLOv8 + P2 小目标检测层（仅增加 P2/4 四尺度检测）

nc: 1  # ship 单类别
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]

# Backbone — 与基线完全一致
backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f, [256, True]]       # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, C2f, [512, True]]       # 6
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 3, C2f, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9

# Head — 增加 P2 路径，但保持标准 C2f 和标准 Detect
head:
  # FPN 自顶向下
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10
  - [[-1, 6], 1, Concat, [1]]                     # 11
  - [-1, 3, C2f, [512]]                           # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [[-1, 4], 1, Concat, [1]]                     # 14
  - [-1, 3, C2f, [256]]                           # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16  ★ 新增: 80→160
  - [[-1, 2], 1, Concat, [1]]                     # 17  ★ 新增: 拼接P2
  - [-1, 3, C2f, [128]]                           # 18  ★ 新增: P2融合

  # PAN 自底向上
  - [-1, 1, Conv, [128, 3, 2]]                    # 19  ★ 新增: 160→80
  - [[-1, 15], 1, Concat, [1]]                    # 20
  - [-1, 3, C2f, [256]]                           # 21

  - [-1, 1, Conv, [256, 3, 2]]                    # 22
  - [[-1, 12], 1, Concat, [1]]                    # 23
  - [-1, 3, C2f, [512]]                           # 24

  - [-1, 1, Conv, [512, 3, 2]]                    # 25
  - [[-1, 9], 1, Concat, [1]]                     # 26
  - [-1, 3, C2f, [1024]]                          # 27

  # 标准 Detect，四尺度
  - [[18, 21, 24, 27], 1, Detect, [nc]]            # 28  Detect(P2, P3, P4, P5)
