# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# =====================================================================================
# YOLOv8-ShipRS: 船舶遥感小目标检测专用模型
# =====================================================================================
#
# 基于 YOLOv8 架构，针对遥感图像中船舶小目标检测进行了三项关键改进:
#
# 1. P2 小目标检测层 (stride=4):
#    - 增加 P2/4 高分辨率检测层，提供 160×160 的特征图（640输入下）
#    - 使得模型能够检测到仅占几个像素的极小目标
#    - 四尺度检测: P2/4, P3/8, P4/16, P5/32
#
# 2. C2f_CA (坐标注意力增强的C2f模块):
#    - 在关键特征提取层使用 CoordAttention 坐标注意力
#    - 分解为 H 方向和 W 方向的1D注意力，精确编码空间位置信息
#    - 放置于骨干网络 P3/P4 层和颈部 P2/P3 融合层（小目标关键路径）
#    - 参数增量约 2-4%，不影响推理速度
#
# 3. AdaptiveDetect (自适应检测头):
#    - 在标准检测头前添加特征精炼模块（FRM）
#    - FRM 使用空洞深度可分离卷积扩大感受野 + ECA 通道注意力
#    - 尺度感知机制: P2 层获得最强增强（dilation=3），P5 层最弱（dilation=1）
#    - 轻量设计，适配 YOLOv8n/s 小模型
#
# 适用数据集: ShipRSImageNet, HRSC2016, DOTA-Ship, SeaShips, 等
#
# 使用示例:
#   model = YOLO("yolov8n-ShipRS.yaml")  # 超轻量版本
#   model = YOLO("yolov8s-ShipRS.yaml")  # 轻量版本（推荐）
#   model.train(data="ship_dataset.yaml", epochs=300, imgsz=640, batch=8)
# =====================================================================================

# 参数配置
nc: 80 # 类别数（使用时根据实际船舶数据集修改，如 ShipRSImageNet 为50类）
scales: # 模型复合缩放常数
  # [depth_multiple, width_multiple, max_channels]
  n: [0.33, 0.25, 1024] # ShipRS-n: 超轻量版本（~3.5M 参数）
  s: [0.33, 0.50, 1024] # ShipRS-s: 轻量版本（~12M 参数，推荐）
  m: [0.67, 0.75, 768]  # ShipRS-m: 中等版本（~27M 参数）

# =====================================================================================
# 骨干网络 (Backbone) — 多尺度特征提取
# =====================================================================================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2   下采样2倍，320×320
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4   下采样4倍，160×160（小目标关键层）
  - [-1, 3, C2f, [128, True]]       # 2        P2 特征提取（标准C2f，保持轻量）
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8   下采样8倍，80×80
  - [-1, 6, C2f_CA, [256, True]]    # 4        P3 特征提取 ★ 坐标注意力增强
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16  下采样16倍，40×40
  - [-1, 6, C2f_CA, [512, True]]    # 6        P4 特征提取 ★ 坐标注意力增强
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32  下采样32倍，20×20
  - [-1, 3, C2f, [1024, True]]      # 8        P5 特征提取（标准C2f，大目标无需额外注意力）
  - [-1, 1, SPPF, [1024, 5]]        # 9        空间金字塔池化（多尺度感受野融合）

# =====================================================================================
# 检测头 (Head) — FPN-PAN 特征融合 + 自适应检测
# =====================================================================================
head:
  # ---------------------
  # 自顶向下路径 (FPN) — 将高层语义信息传递给低层
  # ---------------------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10  上采样: 20→40
  - [[-1, 6], 1, Concat, [1]]                     # 11  拼接骨干P4特征
  - [-1, 3, C2f, [512]]                           # 12  P4 融合

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13  上采样: 40→80
  - [[-1, 4], 1, Concat, [1]]                     # 14  拼接骨干P3特征
  - [-1, 3, C2f_CA, [256]]                        # 15  P3 融合 ★ 坐标注意力（小目标关键层）

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16  上采样: 80→160
  - [[-1, 2], 1, Concat, [1]]                     # 17  拼接骨干P2特征
  - [-1, 3, C2f_CA, [128]]                        # 18  P2 融合 ★ 坐标注意力（最小目标检测层）

  # ---------------------
  # 自底向上路径 (PAN) — 将低层细节信息传递给高层
  # ---------------------
  - [-1, 1, Conv, [128, 3, 2]]                    # 19  下采样: 160→80
  - [[-1, 15], 1, Concat, [1]]                    # 20  拼接头部P3特征
  - [-1, 3, C2f, [256]]                           # 21  P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]                    # 22  下采样: 80→40
  - [[-1, 12], 1, Concat, [1]]                    # 23  拼接头部P4特征
  - [-1, 3, C2f, [512]]                           # 24  P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]                    # 25  下采样: 40→20
  - [[-1, 9], 1, Concat, [1]]                     # 26  拼接骨干P5特征
  - [-1, 3, C2f, [1024]]                          # 27  P5/32-large

  # ---------------------
  # 自适应检测头 — 四尺度检测 (P2/P3/P4/P5)
  # ---------------------
  # AdaptiveDetect: 在标准检测前使用FRM特征精炼模块增强每个尺度的特征
  # P2(160×160): 检测极小船舶, FRM dilation=3, 尺度权重最大
  # P3(80×80):   检测小型船舶, FRM dilation=2
  # P4(40×40):   检测中型船舶, FRM dilation=1
  # P5(20×20):   检测大型船舶, FRM dilation=1, 尺度权重最小
  - [[18, 21, 24, 27], 1, AdaptiveDetect, [nc]]   # AdaptiveDetect(P2, P3, P4, P5)
