# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# =====================================================================================
# YOLOv8-ShipRS-v3: 遥感船舶小目标检测 — 原创改进版
# =====================================================================================
#
# 在 ShipRS (P2 + C2f_CA + AdaptiveDetect) 基础上，针对遥感船舶的独特难点
# 提出三项原创改进，不再是已有模块的简单拼接。
#
# 改进一: DASC 方向感知条形卷积 (Direction-Aware Strip Convolution)
#   问题: 船舶是细长目标（长宽比3:1~10:1），标准3×3方形卷积感受野利用率低
#   方案: 并行1×7和7×1条形卷积，自适应学习方向权重
#   位置: Backbone 的 P3/P4 层，用 C2f_DASC 替代 C2f_CA
#
# 改进二: BSA 背景抑制注意力 (Background-Suppressed Attention)
#   问题: 海面背景均匀但存在波浪/云影干扰，通用注意力不区分背景/前景
#   方案: 高低频分离 → 低频估计背景 → 生成抑制权重 → 保留高频船舶特征
#   位置: Neck 的 FPN/PAN 融合层，用 C2f_BSA 替代 C2f_CA
#
# 改进三: SOAU 小目标感知上采样 (Small-Object-Aware Upsampling)
#   问题: 标准最近邻上采样"无脑复制"，小目标特征在FPN传递中被稀释
#   方案: 可学习局部插值核，根据内容自适应生成上采样权重
#   位置: FPN 自顶向下路径中替代 nn.Upsample
#
# 适用数据集: Airbus Ship Detection, SeaShips, HRSC2016, 等
#
# 使用示例:
#   model = YOLO("yolov8n-ShipRS-v3.yaml")
#   model.train(data="seaship.yaml", epochs=500, nwd=True, nwd_c=2.0)
# =====================================================================================

# 参数配置
nc: 1 # 类别数：ship
scales:
  # [depth_multiple, width_multiple, max_channels]
  n: [0.33, 0.25, 1024] # ShipRS-v3-n: ~4M 参数
  s: [0.33, 0.50, 1024] # ShipRS-v3-s: ~13M 参数（推荐）
  m: [0.67, 0.75, 768] # ShipRS-v3-m: ~28M 参数

# =====================================================================================
# 骨干网络 (Backbone) — DASC 方向感知条形卷积
# =====================================================================================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2   320×320
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4   160×160
  - [-1, 3, C2f, [128, True]] # 2        P2 标准C2f
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8   80×80
  - [-1, 6, C2f_DASC, [256, True]] # 4        P3 ★ 方向感知条形卷积
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16  40×40
  - [-1, 6, C2f_DASC, [512, True]] # 6        P4 ★ 方向感知条形卷积
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32  20×20
  - [-1, 3, C2f, [1024, True]] # 8        P5 标准C2f
  - [-1, 1, SPPF, [1024, 5]] # 9        SPPF

# =====================================================================================
# 检测头 (Head) — SOAU 上采样 + BSA 背景抑制融合
# =====================================================================================
head:
  # ---------------------
  # 自顶向下路径 (FPN) — SOAU 替代最近邻上采样
  # ---------------------
  - [-1, 1, SOAU, [2]] # 10  SOAU上采样: 20→40 ★ 小目标感知
  - [[-1, 6], 1, Concat, [1]] # 11  拼接骨干P4
  - [-1, 3, C2f_BSA, [512]] # 12  P4 融合 ★ 背景抑制

  - [-1, 1, SOAU, [2]] # 13  SOAU上采样: 40→80 ★ 小目标感知
  - [[-1, 4], 1, Concat, [1]] # 14  拼接骨干P3
  - [-1, 3, C2f_BSA, [256]] # 15  P3 融合 ★ 背景抑制

  - [-1, 1, SOAU, [2]] # 16  SOAU上采样: 80→160 ★ 小目标感知
  - [[-1, 2], 1, Concat, [1]] # 17  拼接骨干P2
  - [-1, 3, C2f_BSA, [128]] # 18  P2 融合 ★ 背景抑制（小目标关键层）

  # ---------------------
  # 自底向上路径 (PAN)
  # ---------------------
  - [-1, 1, Conv, [128, 3, 2]] # 19  下采样: 160→80
  - [[-1, 15], 1, Concat, [1]] # 20  拼接P3
  - [-1, 3, C2f_BSA, [256]] # 21  P3/8-small ★ 背景抑制

  - [-1, 1, Conv, [256, 3, 2]] # 22  下采样: 80→40
  - [[-1, 12], 1, Concat, [1]] # 23  拼接P4
  - [-1, 3, C2f, [512]] # 24  P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]] # 25  下采样: 40→20
  - [[-1, 9], 1, Concat, [1]] # 26  拼接P5
  - [-1, 3, C2f, [1024]] # 27  P5/32-large

  # ---------------------
  # 自适应检测头 — 四尺度检测 (P2/P3/P4/P5)
  # ---------------------
  - [[18, 21, 24, 27], 1, AdaptiveDetect, [nc]] # AdaptiveDetect(P2, P3, P4, P5)
