# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# =====================================================================================
# YOLOv8-ShipRS-final: BiFPN + DyHead + CIoU — 遥感船舶小目标检测最终版本
# =====================================================================================
#
# 基于 ShipRS-v5 架构，集成以下改进模块:
#
# 优化一: BiFPN 加权特征融合 (替换标准 Concat)
#   问题: FPN/PAN 中 Concat 对所有输入一视同仁，无法自适应调节特征重要性
#   方案: 为每个融合分支添加可学习权重，快速归一化加权融合
#   预期: +1~3% mAP，自适应学习不同尺度特征的最优融合比例
#
# 优化二: DyHead 动态检测头 (替换 AdaptiveDetect)
#   问题: AdaptiveDetect 的 FRM 使用单一膨胀率 + ECA，空间建模能力有限
#   方案: 并行多尺度空洞 DWConv (d=1,2,3) + SE 通道注意力
#   预期: +1~2% mAP，更强的多尺度空间建模对小目标检测特别有效
#
# 优化三: DASC 方向感知条形卷积 (Backbone P3/P4)
#   问题: 标准卷积对方向信息不敏感，船舶目标具有方向多样性
#   方案: 水平/垂直/对角方向条形卷积核，捕获多方向纹理
#   预期: +0.5~1% mAP
#
# 优化四: BSA 背景抑制注意力 (Neck FPN/PAN)
#   问题: 海洋背景复杂，船舶目标容易被背景噪声干扰
#   方案: 背景建模与抑制，聚焦前景船舶目标
#   预期: +0.5~1% mAP
#
# 优化五: SOAU 小目标感知上采样 (FPN)
#   问题: 标准上采样缺乏语义感知，小目标信息容易模糊
#   方案: 语义感知的上采样权值学习，保留小目标细节
#   预期: +0.5~1% mAP
#
# 优化六: P2 四尺度检测 (160×160)
#   问题: 小目标在浅层特征图中，标准检测头只关注深层特征
#   方案: 增加 P2 检测层，160×160 分辨率捕获小目标
#   预期: +1~2% mAP
#
# 损失函数: 默认 CIoU（未启用 WIoUv3）
#
# 使用示例:
#   model = YOLO("yolov8-ShipRS-final.yaml")
#   model.train(data="seaship.yaml", epochs=500)
# =====================================================================================

# 参数配置
nc: 1 # 类别数：ship
scales:
  # [depth_multiple, width_multiple, max_channels]
  n: [0.33, 0.25, 1024] # ShipRS-final-n: ~4M 参数
  s: [0.33, 0.50, 1024] # ShipRS-final-s: ~14M 参数（推荐）
  m: [0.67, 0.75, 768]  # ShipRS-final-m: ~30M 参数

# =====================================================================================
# 骨干网络 (Backbone) — DASC 方向感知条形卷积
# =====================================================================================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2   320×320
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4   160×160
  - [-1, 3, C2f, [128, True]]          # 2        P2 标准C2f
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8   80×80
  - [-1, 6, C2f_DASC, [256, True]]     # 4        P3 ★ 方向感知条形卷积
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16  40×40
  - [-1, 6, C2f_DASC, [512, True]]     # 6        P4 ★ 方向感知条形卷积
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32  20×20
  - [-1, 3, C2f, [1024, True]]         # 8        P5 标准C2f
  - [-1, 1, SPPF, [1024, 5]]           # 9        SPPF

# =====================================================================================
# 检测头 (Head) — SOAU + BiFPN + DyHead
# =====================================================================================
head:
  # ---------------------
  # 自顶向下路径 (FPN) — SOAU 上采样 + BiFPN 加权融合
  # ---------------------
  - [-1, 1, SOAU, [2]]                  # 10  SOAU上采样: 20→40 ★ 小目标感知
  - [[-1, 6], 1, BiFPNConcat, [1]]     # 11  ★ BiFPN加权融合 (替换Concat)
  - [-1, 3, C2f_BSA, [512]]            # 12  P4 融合 ★ 背景抑制

  - [-1, 1, SOAU, [2]]                  # 13  SOAU上采样: 40→80 ★ 小目标感知
  - [[-1, 4], 1, BiFPNConcat, [1]]     # 14  ★ BiFPN加权融合 (替换Concat)
  - [-1, 3, C2f_BSA, [256]]            # 15  P3 融合 ★ 背景抑制

  - [-1, 1, SOAU, [2]]                  # 16  SOAU上采样: 80→160 ★ 小目标感知
  - [[-1, 2], 1, BiFPNConcat, [1]]     # 17  ★ BiFPN加权融合 (替换Concat)
  - [-1, 3, C2f_BSA, [128]]            # 18  P2 融合 ★ 背景抑制（小目标关键层）

  # ---------------------
  # 自底向上路径 (PAN) — BiFPN 加权融合
  # ---------------------
  - [-1, 1, Conv, [128, 3, 2]]          # 19  下采样: 160→80
  - [[-1, 15], 1, BiFPNConcat, [1]]    # 20  ★ BiFPN加权融合 (替换Concat)
  - [-1, 3, C2f_BSA, [256]]            # 21  P3/8-small ★ 背景抑制

  - [-1, 1, Conv, [256, 3, 2]]          # 22  下采样: 80→40
  - [[-1, 12], 1, BiFPNConcat, [1]]    # 23  ★ BiFPN加权融合 (替换Concat)
  - [-1, 3, C2f, [512]]                # 24  P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]          # 25  下采样: 40→20
  - [[-1, 9], 1, BiFPNConcat, [1]]     # 26  ★ BiFPN加权融合 (替换Concat)
  - [-1, 3, C2f, [1024]]               # 27  P5/32-large

  # ---------------------
  # DyHead 动态检测头 — 四尺度检测 (P2/P3/P4/P5)
  # ---------------------
  - [[18, 21, 24, 27], 1, DyHeadDetect, [nc]]  # ★ DyHead
