# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# =====================================================================================
# YOLOv8-ShipRS-v2: 船舶遥感小目标检测增强模型（第二版）
# =====================================================================================
#
# 在 v1 (P2 + CoordAttention + AdaptiveDetect) 基础上，针对老师提出的
# "底层特征引出 + 特征融合" 建议，结合最新论文进行了以下改进:
#
# 1. 渐进式特征融合 (Progressive Feature Fusion):
#    - 替代传统 PAFPN 的跨层直接拼接方式
#    - 在 FPN 下采样路径中逐级融合，避免跨层信息冲突
#    - P3 融合层接收来自 P2 的渐进信息，而非直接从 P3 backbone 取特征
#    - 设计灵感来自 AFPN (Asymptotic Feature Pyramid Network)
#
# 2. EMA 高效多尺度注意力 (Efficient Multi-Scale Attention):
#    - 替换 v1 中的 CoordAttention，用于 Backbone P3/P4 层和 Neck P2/P3 融合层
#    - 三分支并行（1D水平、1D垂直、1x1），无额外参数开销
#    - 跨空间信息交互机制增强小目标特征表达
#    - 参考: EMA (arXiv:2305.13563)
#
# 3. AdaptiveDetect 检测头（继承 v1）:
#    - FRM 特征精炼模块（空洞深度卷积 + ECA 注意力）
#    - 尺度感知增强权重: P2=1.5, P3=1.33, P4=1.17, P5=1.0
#
# 4. 损失函数改进（训练时配置）:
#    - 推荐使用 Shape-IoU 替代 CIoU（shape_iou=True）
#    - 或使用 NWD（nwd=True, nwd_c=2.0）与 Shape-IoU 组合
#    - Shape-IoU 对非方形目标（如舰船长宽比变化大）更敏感
#
# 训练参数建议:
#   model = YOLO("yolov8-ShipRS-v2.yaml")
#   model.train(data="seaship.yaml", epochs=500, imgsz=640, batch=64,
#               optimizer='SGD', lr0=0.01, lrf=0.01, shape_iou=True)
# =====================================================================================

# 参数配置
nc: 80 # 类别数（使用时根据实际船舶数据集修改）
scales:
  n: [0.33, 0.25, 1024] # ShipRS-v2-n: 超轻量版本
  s: [0.33, 0.50, 1024] # ShipRS-v2-s: 轻量版本（推荐）
  m: [0.67, 0.75, 768] # ShipRS-v2-m: 中等版本

# =====================================================================================
# 骨干网络 (Backbone) — 多尺度特征提取 + EMA 注意力增强
# =====================================================================================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2   下采样2倍，320×320
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4   下采样4倍，160×160（小目标关键层）
  - [-1, 3, C2f, [128, True]] # 2        P2 特征提取（保持轻量）
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8   下采样8倍，80×80
  - [-1, 6, C2f_EMA, [256, True]] # 4        P3 特征提取 ★ EMA 多尺度注意力增强
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16  下采样16倍，40×40
  - [-1, 6, C2f_EMA, [512, True]] # 6        P4 特征提取 ★ EMA 多尺度注意力增强
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32  下采样32倍，20×20
  - [-1, 3, C2f, [1024, True]] # 8        P5 特征提取（标准C2f）
  - [-1, 1, SPPF, [1024, 5]] # 9        空间金字塔池化

# =====================================================================================
# 检测头 (Head) — 渐进式特征融合 + 自适应检测
# =====================================================================================
head:
  # ---------------------
  # 渐进式 FPN 自顶向下路径
  # 设计思路: 每一层只与相邻层融合，避免跨层信息冲突
  # ---------------------

  # 第一步: P5 → P4（相邻层融合）
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10  上采样: 20→40
  - [[-1, 6], 1, Concat, [1]] # 11  拼接骨干P4特征
  - [-1, 3, C2f_EMA, [512]] # 12  P4 融合 ★ EMA 增强

  # 第二步: P4_fused → P3（渐进传递，使用已融合的P4特征而非原始P4）
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13  上采样: 40→80
  - [[-1, 4], 1, Concat, [1]] # 14  拼接骨干P3特征
  - [-1, 3, C2f_EMA, [256]] # 15  P3 融合 ★ EMA 增强

  # 第三步: P3_fused → P2（渐进传递到底层）
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16  上采样: 80→160
  - [[-1, 2], 1, Concat, [1]] # 17  拼接骨干P2特征（底层细节）
  - [-1, 3, C2f, [128]] # 18  P2 融合

  # ---------------------
  # 渐进式 PAN 自底向上路径
  # 设计思路: 将底层细节逐级传递到高层，每层只从相邻层获取信息
  # ---------------------

  # 第四步: P2_fused → P3（底层细节回传）
  - [-1, 1, Conv, [128, 3, 2]] # 19  下采样: 160→80
  - [[-1, 15], 1, Concat, [1]] # 20  拼接 FPN P3 融合特征
  - [-1, 3, C2f, [256]] # 21  P3/8-small

  # 第五步: P3_fused → P4（中层细节传递）
  - [-1, 1, Conv, [256, 3, 2]] # 22  下采样: 80→40
  - [[-1, 12], 1, Concat, [1]] # 23  拼接 FPN P4 融合特征
  - [-1, 3, C2f, [512]] # 24  P4/16-medium

  # 第六步: P4_fused → P5（高层语义补充）
  - [-1, 1, Conv, [512, 3, 2]] # 25  下采样: 40→20
  - [[-1, 9], 1, Concat, [1]] # 26  拼接骨干P5+SPPF特征
  - [-1, 3, C2f, [1024]] # 27  P5/32-large

  # ---------------------
  # 自适应检测头 — 四尺度检测 (P2/P3/P4/P5)
  # ---------------------
  # AdaptiveDetect: FRM 特征精炼 + 尺度感知增强
  # P2(160×160): 检测极小船舶, dilation=3, 权重=1.5
  # P3(80×80):   检测小型船舶, dilation=2, 权重=1.33
  # P4(40×40):   检测中型船舶, dilation=1, 权重=1.17
  # P5(20×20):   检测大型船舶, dilation=1, 权重=1.0
  - [[18, 21, 24, 27], 1, AdaptiveDetect, [nc]] # AdaptiveDetect(P2, P3, P4, P5)
