# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# =====================================================================================
# YOLOv8-ShipRS-v6: BiFPN + DyHead + DualPath — 双路直接检测
# =====================================================================================
#
# 在 ShipRS-v5 基础上，引入核心改进：
#
# 优化: DualPath 双路直接检测
#   问题: 传统 FPN/PAN 只输出精化后的特征，底层细节信息（如小目标纹理、边缘）
#         在多次上采样/下采样中可能丢失
#   方案: 将 Backbone 原始 P2/P3/P4/P5 特征通过 1x1 卷积对齐通道后，
#         直接与 Neck 精化特征拼接，让检测头同时看到"精化特征"和"原始细节特征"
#   预期: +1~2% mAP，保留更多底层细节信息对小目标检测特别重要
#
# 架构说明:
#   - Backbone: P2(2), P3(4), P4(6), P5(8) 原始特征
#   - Neck: FPN+PAN 精化特征输出
#   - DualPath: Backbone原始特征 + Neck精化特征 -> 检测头
#
# 保留 v5 的全部改进:
#   - BiFPN 加权特征融合 (替换标准 Concat)
#   - DyHead 动态检测头 (多尺度空洞 DWConv + SE)
#   - WIoUv3 动态非单调聚焦损失
#   - DASC 方向感知条形卷积 (Backbone P3/P4)
#   - BSA 背景抑制注意力 (Neck FPN/PAN)
#   - SOAU 小目标感知上采样 (FPN)
#   - P2 四尺度检测 (160×160)
#
# 使用示例:
#   model = YOLO("yolov8-ShipRS-v6.yaml")
#   model.train(data="seaship.yaml", epochs=200, wiou=True, wiou_delta=3.0)
# =====================================================================================

# 参数配置
nc: 1 # 类别数：ship
scales:
  # [depth_multiple, width_multiple, max_channels]
  n: [0.33, 0.25, 1024] # ShipRS-v6-n: ~4.5M 参数
  s: [0.33, 0.50, 1024] # ShipRS-v6-s: ~14.5M 参数（推荐）
  m: [0.67, 0.75, 768]  # ShipRS-v6-m: ~31M 参数

# =====================================================================================
# 骨干网络 (Backbone) — DASC 方向感知条形卷积 (继承 v3)
# =====================================================================================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2   320×320
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4   160×160
  - [-1, 3, C2f, [128, True]]          # 2        P2 ★ Backbone原始特征出口
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8   80×80
  - [-1, 6, C2f_DASC, [256, True]]     # 4        P3 ★ Backbone原始特征出口
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16  40×40
  - [-1, 6, C2f_DASC, [512, True]]     # 6        P4 ★ Backbone原始特征出口
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32  20×20
  - [-1, 3, C2f, [1024, True]]         # 8        P5 ★ Backbone原始特征出口
  - [-1, 1, SPPF, [1024, 5]]           # 9        SPPF

# =====================================================================================
# 检测头 (Head) — SOAU + BiFPN + DualPath + DyHeadDetect
# =====================================================================================
head:
  # ---------------------
  # 第一阶段: 标准 FPN + PAN (与 v5 相同)
  # ---------------------
  - [-1, 1, SOAU, [2]]                  # 10  SOAU上采样: 20→40 ★ 小目标感知
  - [[-1, 6], 1, BiFPNConcat, [1]]    # 11  ★ BiFPN加权融合 (替换Concat)
  - [-1, 3, C2f_BSA, [512]]           # 12  P4 融合 ★ 背景抑制

  - [-1, 1, SOAU, [2]]                  # 13  SOAU上采样: 40→80 ★ 小目标感知
  - [[-1, 4], 1, BiFPNConcat, [1]]    # 14  ★ BiFPN加权融合 (替换Concat)
  - [-1, 3, C2f_BSA, [256]]           # 15  P3 融合 ★ 背景抑制

  - [-1, 1, SOAU, [2]]                  # 16  SOAU上采样: 80→160 ★ 小目标感知
  - [[-1, 2], 1, BiFPNConcat, [1]]    # 17  ★ BiFPN加权融合 (替换Concat)
  - [-1, 3, C2f_BSA, [128]]           # 18  P2 融合 ★ 背景抑制（小目标关键层）

  # PAN 自底向上
  - [-1, 1, Conv, [128, 3, 2]]          # 19  下采样: 160→80
  - [[-1, 15], 1, BiFPNConcat, [1]]    # 20  ★ BiFPN加权融合
  - [-1, 3, C2f_BSA, [256]]           # 21  P3/8-small ★ 背景抑制

  - [-1, 1, Conv, [256, 3, 2]]          # 22  下采样: 80→40
  - [[-1, 12], 1, BiFPNConcat, [1]]   # 23  ★ BiFPN加权融合
  - [-1, 3, C2f, [512]]                # 24  P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]          # 25  下采样: 40→20
  - [[-1, 9], 1, BiFPNConcat, [1]]     # 26  ★ BiFPN加权融合
  - [-1, 3, C2f, [1024]]               # 27  P5/32-large

  # ---------------------
  # 第二阶段: DualPath 双路特征融合
  # 将 Backbone 原始特征与 Neck 精化特征拼接
  # ---------------------
  # P5 双路: backbone原始(1024) + neck精化(1024) => 2048
  - [8, 1, Conv, [1024, 1, 1]]          # 28  Backbone P5 1x1对齐 → 1024
  - [[27, 28], 1, Concat, [1]]         # 29  Concat: neck P5(1024) + backbone P5(1024) = 2048
  - [-1, 1, Conv, [1024, 1, 1]]       # 30  1x1降维: 2048 → 1024

  # P4 双路: backbone原始(512) + neck精化(512) => 1024
  - [6, 1, Conv, [512, 1, 1]]           # 31  Backbone P4 1x1对齐 → 512
  - [[24, 31], 1, Concat, [1]]          # 32  Concat: neck P4(512) + backbone P4(512) = 1024
  - [-1, 1, Conv, [512, 1, 1]]          # 33  1x1降维: 1024 → 512

  # P3 双路: backbone原始(256) + neck精化(256) => 512
  - [4, 1, Conv, [256, 1, 1]]           # 34  Backbone P3 1x1对齐 → 256
  - [[21, 34], 1, Concat, [1]]          # 35  Concat: neck P3(256) + backbone P3(256) = 512
  - [-1, 1, Conv, [256, 1, 1]]          # 36  1x1降维: 512 → 256

  # P2 双路: backbone原始(128) + neck精化(128) => 256
  - [2, 1, Conv, [128, 1, 1]]           # 37  Backbone P2 1x1对齐 → 128
  - [[18, 37], 1, Concat, [1]]          # 38  Concat: neck P2(128) + backbone P2(128) = 256
  - [-1, 1, Conv, [128, 1, 1]]          # 39  1x1降维: 256 → 128

  # ---------------------
  # DyHeadDetect 检测头 — 四尺度双路融合特征
  # ---------------------
  - [[39, 36, 33, 30], 1, DyHeadDetect, [nc]]  # ★ DyHeadDetect
