# Ultralytics AGPL-3.0 License
# 消融实验: YOLOv8 + C2f_CA 坐标注意力（仅替换关键层的 C2f 为 C2f_CA）

nc: 1 # ship 单类别
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]

# Backbone — P3/P4 层使用 C2f_CA
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f_CA, [256, True]] # 4  ★ 坐标注意力
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f_CA, [512, True]] # 6  ★ 坐标注意力
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9

# Head — P3 融合层使用 C2f_CA，保持三尺度标准 Detect
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]] # 14
  - [-1, 3, C2f_CA, [256]] # 15  ★ 坐标注意力

  - [-1, 1, Conv, [256, 3, 2]] # 16
  - [[-1, 12], 1, Concat, [1]] # 17
  - [-1, 3, C2f, [512]] # 18

  - [-1, 1, Conv, [512, 3, 2]] # 19
  - [[-1, 9], 1, Concat, [1]] # 20
  - [-1, 3, C2f, [1024]] # 21

  # 标准 Detect，三尺度
  - [[15, 18, 21], 1, Detect, [nc]] # 22  Detect(P3, P4, P5)
